;This file is the display text dictionary of the ContextMenuManager program, and the newline characters in the dictionary are escaped with \r\n or \n

;If you want to help the author add other language dictionaries to this program, you can modify this text and save it in the .\config\languages folder,

;For example, save the American English dictionary as en-US.ini, and assign en-US English to [General]\Language

;Fork the project on Github or Gitee and submit an application to me, or send the file directly to the mailbox 1617859183@qq.com



[General]

AppName = Windows Context Menu Manager

Language = pt-BR Portuguese

Translator = JNylson

TranslatorUrl = https://github.com/JNylson



[ToolBar]

Home = Principal

Type = Tipo de Arquivos

Rule = Outras Regras

Refresh = Atualizar

About = Sobre



[SideBar]

File = Arquivo

Folder = Pasta

Directory = Diretório

Background = Fundo de pastas

Desktop = Área de trabalho

Drive = Disco

AllObjects = Todos os objetos

Computer = Computador

RecycleBin = Lixeira

Library = Biblioteca

New = Novo

SendTo = Enviar para

OpenWith = Abrir com

WinX = Win+X



LnkFile = Arquivos .lnk

UwpLnk = UWP .lnk

ExeFile = Arquivos .exe

CustomExtension = Tipo de arquivo específico

PerceivedType = Tipo de arquivo percebido

DirectoryType = Tipo de pasta

UnknownType = Tipo de arquivo desconhecido

MenuAnalysis = Menu de análise



EnhanceMenu = Menu aprimorado

DetailedEdit = Edição detalhada

DragDrop = Clicar e arrastar

PublicReferences = Referências públicas

CustomRegPath = Local do registro personalizado

GuidBlocked = GUID bloqueado

IEMenu = Menu de contexto do IE



AppSetting = Configurações

AppLanguage = Idioma

CheckUpdate = Verificar por atualizações

Dictionaries = Pasta do programa

AboutApp = Informações do software

Donate = Doar ao autor



[StatusBar]

File = Menu de contexto para todos os tipos de arquivos

Folder = Menu de contexto para todos os tipos de pasta

Directory = Menu de contexto para todas as pastas e arquivos

Background = Menu de contexto para toda a pasta e fundos da Área de trabalho

Desktop = Menu de contexto para a Área de trabalho

Drive = Menu de contexto para todas as unidades de disco

AllObjects = Menu de contexto para todos os objetos do sistema de arquivos (incluindo arquivos e pastas)

Computer = Menu de contexto para Este PC

RecycleBin = Menu de contexto para a Lixeira

Library = Menu de contexto para todas as Bibliotecas e fundo da pasta da biblioteca

New = Menu "Novo" para o menu de contexto de pasta e fundo da Área de trabalho

SendTo = Menu "Enviar para" para todos os objetos do sistema de arquivos

OpenWith = Menu "Abrir Com" para todos os arquivos

WinX = Menu de contexto Win8-Win10 para o Menu Iniciar Win+X



LnkFile = Menu de contexto para todos os atalhos

UwpLnk = Menu de contexto para todos os aplicativos UWP Win10, Win8

ExeFile = Menu de contexto para arquivos executáveis ​​.exe

CustomExtension = Personaliza o menu de contexto para qualquer tipo de arquivo

PerceivedType = Personaliza o menu de contexto para arquivo percebido especificado

DirectoryType = Personaliza o menu de contexto para tipo de pasta especificada

UnknownType = Menu de contexto para tipo de arquivo que não estão associados a nenhum aplicativo

MenuAnalysis = Analise o local do menu de contexto



EnhanceMenu = Adicione alguns itens úteis de menu

DetailedEdit = Regras de configuração detalhadas para os menus internos do sistema e outros programas

DragDrop = Item de menu quando clicar com o botão direito e arrastar um arquivo

PublicReferences = Edite os itens do submenu do tipo shell de referências públicas adicionadas pelos usuários

CustomRegPath = Personalizar o menu de contexto com o local do registro

GuidBlocked = Adequado para projetos ShellEx teimosos que dependem de GUIDs (alguns GUIDs serão desativados)

IEMenu = Menu de contexto para Internet Explorer



[Menu]

ChangeText = Renomear

ItemIcon = Ícone do item

ChangeIcon = Alterar ícone

ShieldIcon = Ícone de escudo

AddIcon = Adicionar ícone

DeleteIcon = Excluir ícone

ItemPosition = Posição do item

SetDefault = Padrão

SetTop = Colocar no topo

SetBottom = Colocar na parte inferior

OtherAttributes = Outros atributos

OnlyWithShift = Mostrar somente ao segurar Shift

OnlyInExplorer = Mostrar apenas no Explorador de Arquivo

NoWorkingDirectory = Não usar informações da pasta no menu de contexto

NeverDefault = Nunca usar botão esquerdo para executar comandos por padrão

ShowAsDisabledIfHidden = Se o item estiver desativado, ficará cinza em vez de oculto

Details = Detalhes

WebSearch = Pesquisa na web

ChangeCommand = Alterar comando

RunAsAdministrator = Executar como administrador

FileProperties = Propriedades do arquivo

FileLocation = Localizar arquivo

RegistryLocation = Localizar no registro

ExportRegistry = Exportar registro

Delete = Excluir item

DeleteReference = Excluir referência

HandleGuid = Ações GUID

CopyGuid = Copiar GUID

BlockGuid = Bloco GUID

ClsidLocation = Localizar CLSID

AddGuidDic = Adicionar ao dicionário do GUID

InitialData = Editar dados iniciais do arquivo

BeforeSeparator = Exibir acima do separador

ChangeGroup = Alterar grupo

RestoreDefault = Restaurar padrão

Edit = Editar

Save = Salvar

FoldAll = Recolher todos

UnfoldAll = Expandir todos



[Dialog]

Browse = Procurar

Program = Programa

AllFiles = Todos os Arquivos

RegistryFile = Arquivo de registro

ItemText = Texto do item

ItemCommand = Comando do menu

CommandArguments = Argumentos de comando

SingleMenu = Menu de nível único

MultiMenu = menu multi-nível

Public = Público

Private = Privado

SelectAll = Selecione todos

InputGuid = Insira o Dicionário GUID local

AddGuidDic = Adicionar Dicionário GUID local

DeleteGuidDic = Excluir dicionário GUID

NoPerceivedType = Tipo desconhecido

TextFile = Arquivo de texto

DocumentFile = Arquivo de documento

ImageFile = Arquivo de imagem

VideoFile = Arquivo de vídeo

AudioFile = Arquivo de áudio

CompressedFile = Arquivo compactado

SystemFile = Arquivo do sistema

DocumentDirectory = Pasta de documentos

ImageDirectory = Pasta de imagem

VideoDirectory = Pasta de vídeo

AudioDirectory = Pasta de áudio

EditSubItems = Editar itens do submenu para "%s"

DetailedEdit = Editar "%s" em detalhes

CheckReference = Verifique o item de menu ao qual você deseja adicionar uma referência a

CheckCopy = Verifique o item de menu que você deseja copiar

SelectExtension = Selecione uma extensão de arquivo

SelectPerceivedType = Por favor, selecione um tipo de arquivo percebido

SelectDirectoryType = Por favor, selecione um tipo de pasta percebida

SelectGroup = Selecione o grupo para salvar

SelectNewItemType = Selecione o "Novo" tipo de item

SelectObjectType = Selecione o tipo de objeto a ser analisado

SelectDropEffect = Selecione o efeito padrão ao arrastar

DefaultDropEffect = Padrão (move na mesma unidade, copia de uma unidade diferente)

CopyDropEffect = Copiar(Ctrl)

MoveDropEffect = Mover(Shift)

CreateLinkDropEffect = Criar atalhos (Alt)

DownloadLanguages = Baixar arquivo de idioma

TranslateTool = Ferramenta de tradução

DefaultText = Texto padrão

OldTranslation = Tradução antiga

NewTranslation = Nova tradução

DonateInfo = Esta lista não é atualizada regularmente, última atualização: %date \r\n\r\nTotal: %money Yuan, %count pessoas



[Message]

TextCannotBeEmpty = O texto do menu não pode estar vazio!

CommandCannotBeEmpty = O comando do menu não pode estar vazio!

StringParsingFailed = A análise de tradução das strings falhou!

TextLengthCannotExceed80 = Texto do menu é muito longo. O comprimento não pode exceder 80 caracteres!

ConfirmDeletePermanently = Tem certeza de que deseja excluir permanentemente este item? \r\n Tenha cuidado, esta operação não pode ser desfeita!

DeleteButCanRestore = Tem certeza que deseja excluir o item de registro deste menu? \r\n Uma vez que o backup automático está ativado (ativado por padrão),\r\n ele pode ser restaurado a partir da pasta de backup após a exclusão.

ConfirmDeleteReference = Tem certeza que deseja excluir esse item? \r\n Tenha cuidado, todos os itens que fazem referência a este item se tornarão inválidos!

ConfirmDelete = Tem certeza que deseja excluir este item?

ConfirmDeleteReferenced = Você tem certeza de que deseja excluir permanentemente este item? \r\n Por favor, note que todos os itens referentes a este item serão inválidos.

CannotAddNewItem = Não é possível adicionar! O sistema limita o número máximo de itens do submenu para 16.

VistaUnsupportedMulti = O Windows Vista não suporta menu multi-nível!

CannotHideSubItem = Sua versão do sistema é muito antiga, não suporta o menu filho oculto!

UnsupportedFilename = Nome do arquivo não suportado,\r\nItens de menu que já podem ter o mesmo nome de arquivo!

NoOpenModeExtension = Esta extensão não possui o modo de abertura padrão,\r\nPor favor, ligue este tipo de arquivo primeiro!

CannotChangePath = Não altere o caminho do arquivo!

CopiedToClipboard = Copiar para área de transferência:

MalformedGuid = GUID com formato incorreto

HasBeenAdded = Este item foi adicionado!

SelectSubMenuMode = O número de subitens do menu multi-nível é 0, Você tem duas escolhas:\r\n1 Todos os itens do submenu neste menu multi-nível serão privados (recomendado),\r\n2 O menu multi-nível pode referenciar os mesmos subitens que outros menus multi-níveis. \r\nFaça sua escolha...

EditInitialData = Este programa atualmente suporta apenas editar os dados iniciais de arquivos de texto simples (.txt, .bat, etc.).\r\n Para outros tipos de arquivos, edite o valor de "dados" do registro por si mesmo.\r\n Confirme se quiser continuar a operação.

PromptIsOpenItem = Este item tem um menu "Aberto",\r\n Operações cegas podem impedir que você abra arquivos e pastas,\r\n Confirme se quiser continuar a operação. (Não recomendado)

SelectRegPath = Passos:\r\n1. Abra o Editor de registro\r\n2. Navegue até o local do Registro de destino\r\n3. Feche a janela do Editor do Registro\nContinuar?

RestartApp = O programa será reiniciado!

FileNotExists = O arquivo não existe!

FolderNotExists = A pasta não existe!

UpdateInfo = Uma versão mais recente está disponível\r\nVersão atual%v1\r\nÚltima versão%v2\r\nDeseja atualizar para a versão mais recente?

UpdateSucceeded = Atualizado com sucesso!

DicUpdateSucceeded = Dicionários e arquivos de idiomas foram atualizados.

VersionIsLatest = A versão atual é a versão mais recente.

WebDataReadFailed = Falha ao buscar dados da Internet.

OpenWebUrl = Abrir a URL?

AuthorityProtection = Este item de registro de menu pode ser protegido pelo software de segurança.\r\n Não pode ser desativado, excluído e outras modificações personalizadas.

WinXSorted = Alguns itens foram renumerados para otimizar a função de classificação.\r\n Você precisa reiniciar o File Explorer antes que as alterações entrem em vigor

RestoreDefault = Confirme para restaurar o item de menu ao padrão.

DeleteGroup = Tem certeza que quer excluir permanentemente este grupo e todos os itens do menu?



[Tip]

RestartExplorer = A área de trabalho piscará por um tempo depois de reiniciar o Explorer. Isso é normal..\r\n Reinicie ou faça login e sair do seu PC também fará com que as alterações entrem em vigor.

CustomFolder = Desativar essa opção também desativará a guia personalizada \r\n no painel de propriedades de objeto do sistema de arquivos.

SendToDrive = Só funciona se um disco removível estiver conectado.\r\n Exibe todas as partições do disco removível.

BuildSendtoMenu = Desativar essa opção acelerará a velocidade pop-up do menu principal \r\n mas vai diminuir a velocidade pop-up do submenu "Enviar para"

InvalidItem = Se um item de menu for inválido, todos os itens de menu \r\n Sob este item será oculto (supressão recomendada).

EditSubItems = Editar itens do submenu

AddReference = Adicionar referência do projeto de referência pública

AddFromPublic = Copiar itens de menu de referências públicas

AddFromParentMenu = Copiar item do menu pai

AddSeparator = Adicionar separador

DeleteGuidDic = Excluir o dicionário GUID local adicionado pelo usuário

LockNewMenu = Uma vez ativado, isso pode impedir que itens de programas de terceiros sejam adicionados\r\n e pode classificar itens existentes (fechar e restaurar)

DropOrSelectObject = Arraste ou selecione um objeto

ConfigPath = Depois de alterar o caminho de configuração e salvamento de arquivos de dados, \r\n alguns dos menus aprimorados que foram ativados se tornarão inválidos.\r\n Eles podem ser reativados no menu aprimorado

CommandFiles = Este comando depende do arquivo de configuração. Mover o local do arquivo de configuração fará com que este item de menu se torne inválido. Reativá-lo.

CreateGroup = Criar um novo grupo

ImmediatelyCheck = Verificar agora



[Other]

CustomFolder = Personalizar es&ta pasta...

BuildSendtoMenu = Criar submenu "Enviar para"

NewItem = Criar novo item de menu

AddGuidBlockedItem = Adicionar item de GUID bloqueado

LockNewMenu = Bloquear o novo menu

InvalidItem = Item de menu inválido:

Separator = >>>>>> Separador <<<<<<

SelectRegPath = Selecione o local do registro

CurrentExtension = A extensão de arquivo atualmente selecionada é %s

CurrentPerceivedType = O tipo de arquivo percebido atualmente selecionado é %s

CurrentDirectoryType = O tipo de pasta percebido atualmente selecionado é %s

CurrentFilePath = Caminho do arquivo atual:

CurrentRegPath = Caminho de registro atual:

WinXSortable = Ativar classificação no menu Win+X

ShowFilePath = Mostrar caminho do arquivo na barra de status

OpenMoreRegedit = Abrir Editor do Registro em uma janela separada

OpenMoreExplorer = Abrir Explorador de Arquivo em uma janela separada

RestartExplorer = O Explorer deve ser reiniciado para que as alterações entrem em vigor.

SwitchDictionaries = Alternar dicionário

WebDictionaries = Dicionários web

UserDictionaries = Dicionário do usuário

DictionaryDescription = Descrição do dicionário

GuidInfosDictionary = Informações GUID

UwpMode = Módulo UWP

Translators = Tradutores

DonationList = Lista de doações

ConfigPath = Local onde salvar arquivos de configuração e de dados

AppDataDir = AppData

AppDir = Diretório do programa

AutoBackup = Fazer backup automático do registro ao excluir menus

SetUpdateFrequency = Frequência de atualização automática

OnceAWeek = 1 vez por semana

OnceAMonth = 1 vez por mês

OnceASeason = 1 vez a cada três meses

NeverCheck = Nunca

SetRequestRepo = Solicitar repositório

ProtectOpenItem = Proteger item do menu "Abrir"

WebSearchEngine = Mecanismo de pesquisa usado para pesquisas na web

CustomEngine = Personalizar

SetCustomEngine = Definir mecanismo de pesquisa (use %s em vez da palavra a pesquisar)

HideDisabledItems = Ocultar itens desativados

HideSysStoreItems = Ocultar itens de armazenamento do sistema

SetPerceivedType = Definir tipo percebido %s...

SetDefaultDropEffect = Definir efeito padrão ao arrastar.

TopMost = Sempre visível



AboutApp = [Compatibilidade] \r\n 1 = Compatível com Win10, 8.1, 8, 7, Vista \r\n 2 = Compatível com sistemas operacionais de 64 e 32 bits \r\n 3 = Compatível com alto DPI, o melhor é 150% \r\n\r\n [Código aberto] \r\n 1 = Linguagem do código: C sharp, Winform, Licença MIT \r\n 2 = Repositório no GitHub: https://github.com/BluePointLilac/ContextMenuManager \r\n 3 = Repositório no Gitee: https://gitee.com/BluePointLilac/ContextMenuManager \r\n\r\n[Dicas] \r\n 1 = Este programa lê/grava uma grande quantidade de arquivos do sistema e entradas de registro, pode ser sinalizado pelo Windows Defender,\r\n pois essas operações são altamente sensíveis, por favor, adicione manualmente este programa à lista de exclusão\r\n\r\n 2 = Alguns itens de menu especiais podem ser afetados por outros fatores, eles não serão exibidos no menu de contexto.\r\n No entanto, eles ainda podem ser exibidos conforme ativado neste programa de acordo com as regras gerais usadas pelo programa. Isto é normal. \r\n\r\n 3 = O método de desativar o menu para cada programa de gerenciamento de menus de contexto pode ser diferente. Recomenda-se não usar vários programas deste tipo ao \r\n mesmo tempo. A maioria dos programas usa um método de retenção de backup simples e volátil. Este programa usa os principais valores fornecidos pelo sistema para \r\n ocultar as operações tanto quanto possível. Se você usou antes outros programas para desativar o item de menu, use o programa correspondente para restaurá-lo, \r\n caso contrário, não poderá ser exibido neste programa. \r\n\r\n 4 = Este programa não foi projetado para limpar programas que foram desinstalados, mas pode ajudá-lo a localizar os registros e arquivos dos tais itens de menu. \r\n Você pode executar suas operações de acordo com o conteúdo relevante. Se é novato ou está inseguro, é recomendado apenas alternar o botão Ativar\Desativar (para reduzir o risco de corromper o sistema operacional).



Dictionaries = [Descrição de dicionário] \r\n Este programa tem vários arquivos de dicionário, e cada um tem um dicionário do usuário e um dicionário de rede. \r\n Se você quiser adicionar um dicionário a este programa, clicar com o botão direito do mouse para salvar o arquivo e siga as instruções no arquivo para adicioná-lo. \r\n Envie seu dicionário para o meu e-mail ou envie para o GitHub para fazer sua contribuição para este projeto. \r\nA aba direita é o conteúdo do dicionário original, você pode alternar a aba para visualizá-lo \r\n\r\n[Conteúdo de dicionário]\n 1 = Dicionário de idioma de exibição do programa (diretório Languages) \r\n 2 = Dicionário de ícone e itens GUID de texto do menu ShellEx (GuidInfosDic.ini) \r\n 3 = Menu de programas de terceiros dicionário de configuração interna (DetailedEditDic.xml) \r\n 4 = Dicionário de itens do Menu aprimorado (EnhanceMenusDic.xml)



Donate = Este programa é totalmente gratuito. Se você o achar útil, poderá doar digitalizando o código QR abaixo \r\n(WeChat, Alipay, Tencent QQ).\r\nA quantia depende de você. Obrigado pelo seu apoio! Eu também espero que você considere dar estrela \r\nno projeto deste programa no Github ou Gitee (isso significa muito para mim!).